{
    "version": "https://jsonfeed.org/version/1",
    "title": "slashtechno",
    "description": "",
    "home_page_url": "https://slashtechno.com",
    "feed_url": "https://slashtechno.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "slashtechno"
    },
    "items": [
        {
            "id": "https://slashtechno.com/min-browser-review/",
            "url": "https://slashtechno.com/min-browser-review/",
            "title": "Min Browser Review",
            "summary": "<p>Recently, I became aware of the browser <a href=\"https://minbrowser.org/\">Min</a>. Min is a simple, minimalistic, open source, Electron browser.</p>\n",
            "content_html": "<p>Recently, I became aware of the browser <a href=\"https://minbrowser.org/\">Min</a>. Min is a simple, minimalistic, open source, Electron browser.</p>\n\n<p>Min can work as a basic browser. It has a very modern and minimalistic interface, focus mode, and even a feature called tasks which allows you to have different workspaces for your tabs.  One downside is that Min does not offer support extensions (as of now). However, it does offer support for 1Password, Bitwarden, and even a built in password manager.</p>\n<p> </p>\n<h4> </h4>\n<h3 class=\"align-center\">Speed</h3>\n<p>When using Min, I found the speed to be reasonably fast. This may be partly due to the fact that Min does not have some advanced features (syncing, extensions, etc.) compared to many other browsers.</p>\n<p> </p>\n<h3 class=\"align-center\">Interface Navigation Speed</h3>\n<p>With DuckDuckGo bang autocomplete and Min tasks, the workflow in Min is vaguely similar to that of Ubuntu. It is easy to muti-task in one window while keeping tabs separate. Almost like tab grouping in Google Chrome.</p>\n<p> </p>\n<h3 class=\"align-center\">Conclusion</h3>\n<p>Min is a good browser that is open source and is fast. However, because the browser is very simple, not everything is compatible and extensions are nearly non existent. However, with password manager support and tracker blocking, Min is a simple browser that could easily be used day to day. </p>\n<p> </p>",
            "author": {
                "name": "slashtechno"
            },
            "tags": [
            ],
            "date_published": "2021-07-10T19:57:20-05:00",
            "date_modified": "2021-07-10T20:00:31-05:00"
        },
        {
            "id": "https://slashtechno.com/my-thoughts-on-the-m1-ipad/",
            "url": "https://slashtechno.com/my-thoughts-on-the-m1-ipad/",
            "title": "My Thoughts on the M1 iPad",
            "summary": "If you are a person reading this website, you probably are aware of the M1 iPad Pro. If not, check it out. Basically Apple took a Macbook Air, took away the keyboard, and made OS X into iPad OS. I think that the price of&hellip;",
            "content_html": "<p class=\"align-left\">If you are a person reading this website, you probably are aware of the M1 iPad Pro. If not, <a href=\"https://www.apple.com/ipad-pro/\" target=\"_blank\" rel=\"noopener\">check it out</a>.</p>\n<p class=\"align-left\"> Basically Apple took a Macbook Air, took away the keyboard, and made OS X into iPad OS. I think that the price of the iPad itself, for the hardware, is really good. Buying this iPad a good deal in the sense that you are getting a very powerful machine. However, iPad OS is turning this very powerful machine, into a 2 in 1 Chromebook with some more apps. However, if in the future they allow the iPad to run OS X, it would be incredible. You will be getting around the same performance of the $1,299 Macbook Pro. Even better, this would have been a $700 Macbook with a touchscreen, and a keyboard (for another $300 though).</p>\n<p> </p>\n<p>Anyway, thanks for reading.</p>",
            "author": {
                "name": "slashtechno"
            },
            "tags": [
            ],
            "date_published": "2021-05-28T16:29:49-05:00",
            "date_modified": "2021-05-28T16:36:51-05:00"
        },
        {
            "id": "https://slashtechno.com/backup-an-external-usb-to-google-drive/",
            "url": "https://slashtechno.com/backup-an-external-usb-to-google-drive/",
            "title": "Backup Storage Drives with Linux",
            "summary": " If you use Ubuntu (or even other Linux Distros), Deja Dup can be used to backup storage drives to many different storage locations, including Google Drive. You can easily install Deja Dup with Snap. After installing Snap, you can run: sudo snap install deja-dup&hellip;",
            "content_html": "<div class=\"wrapper post__entry\">\n<p class=\"align-center\">If you use Ubuntu (or even other Linux Distros), <a href=\"https://snapcraft.io/deja-dup\" target=\"_blank\" rel=\"noopener\">Deja Dup</a> can be used to backup storage drives to many different storage locations, including Google Drive.</p>\n<h2 class=\"align-center\">Installation</h2>\n<p class=\"align-center\"> You can easily install Deja Dup with <a href=\"https://snapcraft.io/docs/installing-snapd\" target=\"_blank\" rel=\"noopener\">Snap</a>. After installing Snap, you can run:</p>\n<pre class=\"p-code-snippet__block--icon is-wrapped\"><code id=\"snap-install-alt\">sudo snap install deja-dup --classic</code></pre>\n<h2 class=\"align-center\">Usage</h2>\n<p>Just open up Deja Dup, select your backup location, what to backup, and begin the backup. The interface is quite straightforward and easy to use.</p>\n<h4 class=\"align-center\">One more thing</h4>\n<p>If you are using Ubuntu, you may want to uninstall Deja Dup if it is installed. This is because the preinstalled version of Deja Dup may not be using Snap.</p>\n</div>",
            "author": {
                "name": "slashtechno"
            },
            "tags": [
            ],
            "date_published": "2021-05-28T16:29:28-05:00",
            "date_modified": "2021-08-05T16:31:54-05:00"
        },
        {
            "id": "https://slashtechno.com/samsung-t7-review/",
            "url": "https://slashtechno.com/samsung-t7-review/",
            "title": "Samsung T7 Review",
            "summary": "I recently bought a Samsung T7 and I was (and am) amazed. I am currently running Ubuntu and Kali Linux off of it. In fact I am typing this on the SSD. The T7 is thin and very compact, yet it feels (and is) durable&hellip;",
            "content_html": "<p>I recently bought a Samsung T7 and I was (and am) amazed. I am currently running Ubuntu and Kali Linux off of  it. In fact I am typing this on the SSD.</p>\n<h2 class=\"align-center\">Design</h2>\n<p>The T7 is thin and very compact, yet it feels (and is) durable and sturdy. If you are looking to buy this SSD, I recommend the red or blue versions. </p>\n<h2 class=\"align-center\">Speed!</h2>\n<p>For general use, the T7 is more then fast enough. If you are looking for a SSD to run an OS off of, I would recommend the T7. Also, it supports USB-C. This SSD (even over USB 2.0) is faster then some internal hard drives.</p>\n<h2 class=\"align-center\">Encryption</h2>\n<p>With Samsung's software, you can encrypt the normal T7 with password encryption. If you spend the extra money for the Samsung T7 Touch, you can add fingerprint encryption. </p>\n<h2 class=\"align-center\">Drawbacks</h2>\n<p>The only drawback that I have noticed is the cooling. Or lack of cooling. Samsung claims to have an advanced cooling solution but when I was installing Kali Linux it did heat up slightly.</p>\n<h2 class=\"msg--info align-center\">Conclusion</h2>\n<p>If you want a decent portable SSD, buy the Samsung T7. It is much faster then a hard drive, has encryption, is durable, and has a great design.  </p>",
            "author": {
                "name": "slashtechno"
            },
            "tags": [
            ],
            "date_published": "2021-05-28T16:28:55-05:00",
            "date_modified": "2021-05-28T16:28:55-05:00"
        }
    ]
}
